Tekla.Structures.Drawing.DPMPrinterAttributes
The DPMPrinterAttributes class contains the attributes for controlling the printing.

Tekla.Structures.Drawing.DPMPrinterAttributes.outputType
Whether to print to a physical printer, file or PDF file.

Tekla.Structures.Drawing.DPMPrinterAttributes.printerName
The printer name. Not applicable when PDF printing in use.

Tekla.Structures.Drawing.DPMPrinterAttributes.paperSize
Paper size name.

Tekla.Structures.Drawing.DPMPrinterAttributes.scalingMethod
The scaling method.

Tekla.Structures.Drawing.DPMPrinterAttributes.scaleFactor
The scale factor. Applicable when scaling method is "Manual".

Tekla.Structures.Drawing.DPMPrinterAttributes.orientation
The print orientation type.

Tekla.Structures.Drawing.DPMPrinterAttributes.numberOfCopies
The number of copies of each page.

Tekla.Structures.Drawing.DPMPrinterAttributes.colorMode
Output color mode.

Tekla.Structures.Drawing.DPMPrinterAttributes.outputFileName
Output file name and path. Applicable in PDF printing.

Tekla.Structures.Drawing.DPMPrinterAttributes.openFileWhenFinished
Whether to open file when finished.

Tekla.Structures.Drawing.DPMPrinterAttributes.printToMultipleSheet
Whether to print to multiple sheets.

Tekla.Structures.Drawing.DPMPrinterAttributes.OutputType
The printing output type.

Tekla.Structures.Drawing.DPMPrinterAttributes.PrinterName
The printer name.

Tekla.Structures.Drawing.DPMPrinterAttributes.PaperSize
The paper size name.

Tekla.Structures.Drawing.DPMPrinterAttributes.ScalingMethod
The print scaling method.

Tekla.Structures.Drawing.DPMPrinterAttributes.ScaleFactor
The print scale factor.

Tekla.Structures.Drawing.DPMPrinterAttributes.Orientation
The print orientation type.

Tekla.Structures.Drawing.DPMPrinterAttributes.NumberOfCopies
The number of copies of each drawing to print.
Only applicable for printing to a printer.

Tekla.Structures.Drawing.DPMPrinterAttributes.ColorMode
Output color mode.

Tekla.Structures.Drawing.DPMPrinterAttributes.OutputFileName
Output file name and path. Applicable in PDF printing.

Tekla.Structures.Drawing.DPMPrinterAttributes.OpenFileWhenFinished
Whether to open file when finished.

Tekla.Structures.Drawing.DPMPrinterAttributes.PrintToMultipleSheet
Whether to print to multiple sheets.

Tekla.Structures.Drawing.DPMPrinterAttributes.#ctor
Creates a new PrintAttributes instance.

Tekla.Structures.Drawing.DPMPrinterAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.